{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4-tf", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [["input_1", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d", "config": {"data_format": "channels_last", "filters": 16, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2", 0, 0, {}]], "class_name": "Activation", "name": "activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation"}}, {"inbound_nodes": [["activation", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d"}}, {"inbound_nodes": [["spatial_dropout2d", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"data_format": "channels_last", "filters": 16, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_1", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_1", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_1", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_1", 0, 0, {}]], "class_name": "Activation", "name": "activation_1", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_1"}}, {"inbound_nodes": [["activation_1", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_1", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_1"}}, {"inbound_nodes": [["spatial_dropout2d_1", 0, 0, {}]], "class_name": "MaxPooling2D", "name": "max_pooling2d", "config": {"pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "trainable": true, "strides": [2, 2], "name": "max_pooling2d", "padding": "valid"}}, {"inbound_nodes": [["max_pooling2d", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"data_format": "channels_last", "filters": 32, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_2", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_2", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_2", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_2", 0, 0, {}]], "class_name": "Activation", "name": "activation_2", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_2"}}, {"inbound_nodes": [["activation_2", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_2", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_2"}}, {"inbound_nodes": [["spatial_dropout2d_2", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"data_format": "channels_last", "filters": 32, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_3", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_3", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_3", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_3", 0, 0, {}]], "class_name": "Activation", "name": "activation_3", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_3"}}, {"inbound_nodes": [["activation_3", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_3", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_3"}}, {"inbound_nodes": [["spatial_dropout2d_3", 0, 0, {}]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}}, {"inbound_nodes": [["max_pooling2d_1", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"data_format": "channels_last", "filters": 64, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_4", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_4", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_4", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_4", 0, 0, {}]], "class_name": "Activation", "name": "activation_4", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_4"}}, {"inbound_nodes": [["activation_4", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_4", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_4"}}, {"inbound_nodes": [["spatial_dropout2d_4", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"data_format": "channels_last", "filters": 64, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_5", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_5", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_5", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_5", 0, 0, {}]], "class_name": "Activation", "name": "activation_5", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_5"}}, {"inbound_nodes": [["activation_5", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_5", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_5"}}, {"inbound_nodes": [["spatial_dropout2d_5", 0, 0, {}]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}}, {"inbound_nodes": [["max_pooling2d_2", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"data_format": "channels_last", "filters": 128, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_6", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_6", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_6", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_6", 0, 0, {}]], "class_name": "Activation", "name": "activation_6", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_6"}}, {"inbound_nodes": [["activation_6", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_6", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_6"}}, {"inbound_nodes": [["spatial_dropout2d_6", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"data_format": "channels_last", "filters": 128, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_7", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_7", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_7", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_7", 0, 0, {}]], "class_name": "Activation", "name": "activation_7", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_7"}}, {"inbound_nodes": [["activation_7", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_7", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_7"}}, {"inbound_nodes": [["spatial_dropout2d_7", 0, 0, {}]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid"}}, {"inbound_nodes": [["max_pooling2d_3", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"data_format": "channels_last", "filters": 256, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_8", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_8", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_8", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_8", 0, 0, {}]], "class_name": "Activation", "name": "activation_8", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_8"}}, {"inbound_nodes": [["activation_8", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_8", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_8"}}, {"inbound_nodes": [["spatial_dropout2d_8", 0, 0, {}]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose", "config": {"data_format": "channels_last", "filters": 128, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [2, 2], "name": "conv2d_transpose", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [2, 2], "bias_regularizer": null, "output_padding": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [[["spatial_dropout2d_7", 0, 0, {}], ["conv2d_transpose", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate", "dtype": "float32"}}, {"inbound_nodes": [["concatenate", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"data_format": "channels_last", "filters": 128, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_9", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_9", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_9", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_9", 0, 0, {}]], "class_name": "Activation", "name": "activation_9", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_9"}}, {"inbound_nodes": [["activation_9", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_9", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_9"}}, {"inbound_nodes": [["spatial_dropout2d_9", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"data_format": "channels_last", "filters": 128, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_10", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_10", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_10", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_10", 0, 0, {}]], "class_name": "Activation", "name": "activation_10", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_10"}}, {"inbound_nodes": [["activation_10", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_10", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_10"}}, {"inbound_nodes": [["spatial_dropout2d_10", 0, 0, {}]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"data_format": "channels_last", "filters": 64, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [2, 2], "name": "conv2d_transpose_1", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [2, 2], "bias_regularizer": null, "output_padding": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [[["spatial_dropout2d_5", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "trainable": true, "name": "concatenate_1", "dtype": "float32"}}, {"inbound_nodes": [["concatenate_1", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"data_format": "channels_last", "filters": 64, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_11", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_11", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_11", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_11", 0, 0, {}]], "class_name": "Activation", "name": "activation_11", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_11"}}, {"inbound_nodes": [["activation_11", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_11", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_11"}}, {"inbound_nodes": [["spatial_dropout2d_11", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"data_format": "channels_last", "filters": 64, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_12", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_12", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_12", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_12", 0, 0, {}]], "class_name": "Activation", "name": "activation_12", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_12"}}, {"inbound_nodes": [["activation_12", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_12", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_12"}}, {"inbound_nodes": [["spatial_dropout2d_12", 0, 0, {}]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"data_format": "channels_last", "filters": 32, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [2, 2], "name": "conv2d_transpose_2", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [2, 2], "bias_regularizer": null, "output_padding": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [[["spatial_dropout2d_3", 0, 0, {}], ["conv2d_transpose_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2", "config": {"axis": -1, "trainable": true, "name": "concatenate_2", "dtype": "float32"}}, {"inbound_nodes": [["concatenate_2", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"data_format": "channels_last", "filters": 32, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_13", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_13", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_13", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_13", 0, 0, {}]], "class_name": "Activation", "name": "activation_13", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_13"}}, {"inbound_nodes": [["activation_13", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_13", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_13"}}, {"inbound_nodes": [["spatial_dropout2d_13", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"data_format": "channels_last", "filters": 32, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_14", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_14", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_14", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_14", 0, 0, {}]], "class_name": "Activation", "name": "activation_14", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_14"}}, {"inbound_nodes": [["activation_14", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_14", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_14"}}, {"inbound_nodes": [["spatial_dropout2d_14", 0, 0, {}]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"data_format": "channels_last", "filters": 16, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [2, 2], "name": "conv2d_transpose_3", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [2, 2], "bias_regularizer": null, "output_padding": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [[["spatial_dropout2d_1", 0, 0, {}], ["conv2d_transpose_3", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3", "config": {"axis": -1, "trainable": true, "name": "concatenate_3", "dtype": "float32"}}, {"inbound_nodes": [["concatenate_3", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"data_format": "channels_last", "filters": 16, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_15", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_15", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_15", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_15", 0, 0, {}]], "class_name": "Activation", "name": "activation_15", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_15"}}, {"inbound_nodes": [["activation_15", 0, 0, {}]], "class_name": "SpatialDropout2D", "name": "spatial_dropout2d_15", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "spatial_dropout2d_15"}}, {"inbound_nodes": [["spatial_dropout2d_15", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"data_format": "channels_last", "filters": 16, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_16", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_16", 0, 0, {}]], "class_name": "BatchNormalizationV2", "name": "batch_normalization_v2_16", "config": {"gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": [3], "center": true, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_v2_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [["batch_normalization_v2_16", 0, 0, {}]], "class_name": "Activation", "name": "activation_16", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_16"}}, {"inbound_nodes": [["activation_16", 0, 0, {}]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"data_format": "channels_last", "filters": 1, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "name": "conv2d_17", "use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "bias_constraint": null}}, {"inbound_nodes": [["conv2d_17", 0, 0, {}]], "class_name": "Activation", "name": "activation_17", "config": {"dtype": "float32", "trainable": true, "activation": "sigmoid", "name": "activation_17"}}], "name": "model", "input_layers": ["input_1", 0, 0], "output_layers": ["activation_17", 0, 0]}}